from datetime import datetime, timedelta

import pandas as pd
from pytest import fixture


@fixture
def transactions():
    data = [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -160.89,
            "Валюта операции": "RUB",
            "Сумма платежа": -160.89,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 01:20:42",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -100,
            "Валюта операции": "CNY",
            "Сумма платежа": -100,
            "Валюта платежа": "CNY",
            "Кэшбэк": "nan",
            "Категория": "Различные товары",
            "MCC": 5399.0,
            "Описание": "Ozon.ru",
            "Бонусы (включая кэшбэк)": 5,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 100,
        },
        {
            "Дата операции": "31.12.2021 16:42:04",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -64.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -64.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 64.0,
        },
        {
            "Дата операции": "31.12.2021 16:39:04",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -118.12,
            "Валюта операции": "RUB",
            "Сумма платежа": -118.12,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Наличные",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 118.12,
        },
        {
            "Дата операции": "31.12.2021 15:44:39",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -78.05,
            "Валюта операции": "RUB",
            "Сумма платежа": -78.05,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Переводы",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 78.05,
        },
    ]
    return data


@fixture(
    params=[
        (4578, "Дата должна быть строкой"),
        ("", "Дата не может быть пустой"),
        ("20-03-25", "Некорректный формат даты"),
    ]
)
def get_date_interval_fixture(request):
    return request.param


@fixture(params=[(10, "Доброе утро"), (14, "Добрый день"), (20, "Добрый вечер"), (2, "Доброй ночи")])
def get_greeting_fixture(request):
    return request.param


@fixture
def search_word_fixture():
    data = [
        {"Описание": "Перевод +7 987 65-43-21"},
        {"Описание": "Оплата Василий П."},
        {"Описание": "Оплата Петр В."},
        {"Описание": "Метро Санкт-Петербург"},
        {"Описание": "Метро Мск"},
    ]
    return data


@fixture
def start_date():
    return datetime.strptime("2021-12-01 16:44:00", "%Y-%m-%d %H:%M:%S")


@fixture
def end_date():
    return datetime.strptime("2021-12-31 16:44:00", "%Y-%m-%d %H:%M:%S")


@fixture(params=[0, 1, 2, 3])
def filtered_transactions_fixture(request, transactions, start_date, end_date):
    test_cases = [
        (transactions, start_date, end_date, 5),
        ([], start_date, end_date, 0),
        (transactions, "", "", 0),
        (
            [{"Дата операции": "31.12.2021 16:44:00", "Дата платежа": "31.12.2021"}],
            start_date,
            end_date,
            0,
        ),
    ]
    return test_cases[request.param]


@fixture(
    params=[
        ([], pd.DataFrame()),
        ([{"Дата операции": "31.12.2021 16:44:00", "Дата платежа": "31.12.2021"}], pd.DataFrame()),
        (
            {
                "Дата операции": "31.12.2021 01:23:42",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*5091",
                "Сумма операции": 0,
                "Валюта операции": "RUB",
                "Сумма платежа": 0,
                "Валюта платежа": "RUB",
            },
            pd.DataFrame(),
        ),
    ]
)
def transaction_exchange_error_fixture(request):
    return request.param


@fixture(params=[0, 1])
def card_sum_cashback_fixture(request):
    test_cases = [
        ([], None, 0.0, 0.0),
        ([{"Дата операции": "31.12.2021 16:44:00", "Дата платежа": "31.12.2021"}], None, 0.0, 0.0),
    ]
    return test_cases[request.param]


@fixture
def sample_transactions():
    data = {
        "Дата платежа": [
            (datetime.today() - timedelta(days=10)).strftime("%d.%m.%Y"),
            (datetime.today() - timedelta(days=100)).strftime("%d.%m.%Y"),
            (datetime.today() - timedelta(days=30)).strftime("%d.%m.%Y"),
        ],
        "Категория": ["Еда", "Одежда", "Еда"],
        "Сумма платежа": [500, 1000, 200],
    }
    return pd.DataFrame(data)
